--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
do
function run(msg, matches)
  if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
اهلا بكم هناك 7 اوامر في البوت  

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

🎈 م1 : لعرض اوامر الادمنيه  🎐

🎈 م2 : لعرض اوامر الميديا🎐

🎈 م3 : لعرض اوامر حماية 🎐

🎈 م4 : لعرض اوامر الحماية 🎐

🎈 م5 : لعرض اوامر الحماية 🎐

🎈 م6 : لعرض اوامر المجموعه 🎐

🎈 م7 : لعرض اوامر المطورين 🎐
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛  اوامر تخص الادمنيه 📛
ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

♻️ حظر 
❗️لحظر وطرد عضو في المجموعه
♻️ الغاء الحظر
❗️لالغاء الحظر عن عضو
♻️ منع + الكلمه 
❗️لمنع كلمه داخل بالمجموعه 

♻️ الغاء منع + الكلمه 
❗️لالغاء منع كلمه داخل بالمجموعه 
♻️ قائمه المنع 
❗️لاظهار  قائمه الكلمات الممنوعه
♻️ تنظيف قائمه المنع 
❗️لمسح قائمه المنع 

♻️ كتم بالرد او معرف او الايدي
❗️لكتم عضو داخل المجموعه 
♻️ ايدي 
❗️لعرض ايدي المجموعه 
♻️ ايدي بالرد 
❗️لعرض ايدي شخص بالمجموعه
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛 اوامر فتح وقفل الميديا في المجموعه 📛

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

⚠️ قفل الفيديو 
❗️ لقفل الفيديوهات بالمجموعه 
⚠️ قفل الصور 
❗️ لقفل الصور بالمجموعه 
⚠️ قفل الصوت 
❗️ لقفل الصوت بالمجموعه 

⚠️ قفل الصور المتحركه 
❗️ لقفل الصور المتحركه بالمجموعه 
⚠️ قفل الملصقات 
❗️ لقفل الملصقات بالمجموعه 

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

✅ فتح الفيديو 
❗️ لفتح الفيديوهات بالمجموعه 
✅ فتح الصور 
❗️ لفتح الصور بالمجموعه 
✅ فتح الصوت 
❗️ لفتح الصوت بالمجموعه 

✅ فتح الصور المتحركه 
❗️ لفتح الصور المتحركه بالمجموعه 
✅ فتح الملصقات 
❗️ لفتح الملصقات بالمجموعه 
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛 اوامر حمايه في المجموعه 📛

⚠️ قفل اعاده توجيه 
❗️لقفل اعاده توجيه بالمجموعه
⚠️ قفل الكلايش 
❗️ لقفل الكلايش بالمجموعه 
⚠️ قفل التكرار 
❗️ لقفل التكرار بالمجموعه 

⚠️ ضع تكرار + عدد 
❗️لوضع تكرار بالعدد للمجموعه
⚠️ قفل العربيه 
❗️لقفل اللغه العربيه بالمجموعه
⚠️ قفل جهات الاتصال
❗️لقفل جهات الاتصال بالمجموعه

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

✅ فتح اعاده توجيه 
❗️لفتح اعاده توجيه بالمجموعه
✅ فتح الكلايش 
❗️لفتح الكلايش بالمجموعه
✅ فتح التكرار 
❗️لفتح التكرار بالمجموعه

✅ فتح العربيه 
❗️لفتح اللغه العربيه بالمجموعه
✅ فتح  جهات الاتصال 
❗️لفتح جهات الاتصال بالمجموعه
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
------------------
   elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛 اوامر حمايه في المجموعه 📛

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

⚠️ قفل المعرف 
❗️ لقفل علامه ( @ ) بالمجموعه 
⚠️ قفل التاك 
❗️لقفل علامه ( # ) بالمجموعه

⚠️ قفل الشارحه 
❗️لقفل علامه ( / ) بالمجموعه
⚠️ قفل الاضافه 
❗️ لقفل الاضافه بالمجموعه 

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

✅ فتح المعرف 
❗️ لفتح علامه ( @ ) بالمجموعه 
✅ فتح التاك 
❗️ لفتح علامه ( # ) بالمجموعه 

✅ فتح الشارحه 
❗️ لفتح علامه ( / ) بالمجموعه 
✅ فتح الاضافه 
❗️ لفتح الاضافه بالمجموعه 
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك  هنا '..'\n'
.."msg : "..msg.text.."\n" 
----------------------

   elseif  matches[1] == "م5" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛 اوامر حمايه في المجموعه 📛

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

⚠️ قفل الدردشه 
❗️لقفل الدردشه بالمجموعه
⚠️ قفل الروابط 
❗️ لقفل الروابط بالمجموعه 
⚠️ قفل البوتات 
❗️ لقفل البوتات بالمجموعه 

⚠️ قفل السمايل 
❗️ لقفل السمايلات بالمجموعه 
⚠️ قفل الانلاين 
❗️ لقفل اللسته الشفافه بالمجموعه 

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

✅ فتح الدردشه 
❗️ لفتح الدردشه بالمجموعه 
✅ فتح الروابط 
❗️ لفتح الروابط بالمجموعه 
✅ فتح البوتات 
❗️لفتح البوتات بالمجموعه

✅ فتح السمايل 
❗️ لفتح السمايلات بالمجموعه 
✅ فتح الانلاين 
❗️ لفتح اللسته الشفافه بالمجموعه 
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
--------------------

 elseif  matches[1] == "م6" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛 اوامر تخص  المجموعه 📛

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

♻️ ضع صوره
❗️لوضع صوره للمجموعه
♻️ ضع قوانين + القوانين
❗️لوضع قوانين للمجموعه
♻️ ضع وصف + الوصف 
❗️لوضع وصف للمجموعه 

♻️ ضع اسم + الاسم 
❗️لوضع اسم للمجموعه 
♻️ ضع  معرف + المعرف
❗️لوضع معرف للمجموعه
♻️ ضع رابط 
❗️لخزن رابط المجموعه بالبوت
♻️ الرابط 
❗️لاظهار رابط المجموعه المخزون 
♻️ الرابط خاص  
❗️لارسال رابط بالخاص

♻️ معلوماتي 
❗️لعرض معلومات الشخص
♻️ معلومات المجموعه 
❗️لعرض معلومات المجموعه
♻️ اعدادات الوسائط
❗️لاظهار اعدادات الوسائط
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
-----------------------

 elseif  matches[1] == "م7" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛  اوامر المطورين 📛

ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ

💢 تفعيل 
☑️  لتفعيل البوت بالمجموعه 
💢 تعطيل
☑️  لتعطيل البوت بالمجموعه 
💢 اذاعه 
☑️  لنشر شئ بكل مجموعات البوت 
💢 زحلك
☑️  لطرد البوت من المجموعه 
💢 جلب ملف + اسم الملف فقط  
☑️  لجلب ملف من سيرفر البوت 
💢 صنع مجموعه + الاسم 
☑️ لصنع مجموعه بواسطه حساب البوت
]].."\n"
.."ـ  ➖ 🔷  ➖ 🔷 ➖ 🔷 ➖  ـ".."\n"
..'Dev Bot 🎈 :  ضع معرفك هنا '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^(م6)",
    "^(م7)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)",
    "^[#!/](م6)",
    "^[#!/](م7)"

  },
  run = run
}
end

--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
--]]
