--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
do
function run(msg, matches)
  if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⏺-اهلا بكم هناك 5 اوامر في البوت🔸
🔸--------------------------🔹

🎈م1 : لعرض اوامر الادمنيه و المدير🎐

🎈م2 : لعرض اوامر الميديا🎐

🎈م3 : لعرض اوامر حماية 🎐

🎈م4 : لعرض اوامر المجموعه 🎐

🎈م5 : لعرض اوامر المطورين 🎐

⏺- تعمل جميع الاوامر مع [!#/] و بدون [#/!]
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔺- رفع ادمن
❗لرفع ادمن عن طريق الرد + معرف

🔺- تنزيل ادمن
❗لتنزيل ادمن عن طريق الرد + معرف

🔺- رفع اداري
❗لرفع اداري عن طريق الرد + معرف

🔺- تنزيل اداري
❗لتنزيل اداري عن طريق الرد + معرف

🔺-️ حظر 
❗️لحظر وطرد عضو في المجموعه

🔺-️ الغاء حظر
❗️لالغاء الحظر عن عضو

🔺-️ منع + الكلمه 
❗️لمنع كلمه داخل بالمجموعه 

🔺-️ الغاء منع + الكلمه 
❗️لالغاء منع كلمه داخل بالمجموعه 

🔺-️ قائمه المنع 
❗️لاظهار  قائمه الكلمات الممنوعه

🔺-️ ايدي 
❗️لعرض ايدي المجموعه
 
🔺-️ ايدي بالرد 
❗️لعرض ايدي شخص بالمجموعه

🔺- تنظيف قائمه المنع 
❗️لمسح قائمه المنع 

🔺- كتم بالرد او معرف او الايدي
❗️لكتم عضو داخل المجموعه

🔺- المكتومين
❗️لعرض قائمه المكتومين
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔱 اوامـر قــفـل و فــتـح الــميديـا 🔱
🔸--------------------------🔹

⚠️ قفل الفيديو 
❗️ لقفل الفيديوهات بالمجموعه 

⚠️️ قفل الصور 
❗️ لقفل الصور بالمجموعه 

⚠️ قفل الصوت 
❗️ لقفل الصوت بالمجموعه 

⚠️ قفل الصور المتحركه 
❗️ لقفل الصور المتحركه بالمجموعه 

⚠️ قفل الملصقات 
❗️ لقفل الملصقات بالمجموعه 

🔸--------------------------🔹

✅ فتح الفيديو 
❗️ لفتح الفيديوهات بالمجموعه 

✅ فتح الصور 
❗️ لفتح الصور بالمجموعه 

✅ فتح الصوت 
❗️ لفتح الصوت بالمجموعه 

✅ فتح الصور المتحركه 
❗️ لفتح الصور المتحركه بالمجموعه 

✅ فتح الملصقات 
❗️ لفتح الملصقات بالمجموعه 
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛اوامـــر حمـــايه الـــمجمـــوعه📛
🔸--------------------------🔹

⚠️ قفل اعاده توجيه 
❗️️لقفل اعاده توجيه بالمجموعه

⚠️️ قفل الكلايش 
❗️ لقفل الكلايش بالمجموعه 

⚠️️ قفل التكرار 
❗️ لقفل التكرار بالمجموعه 

⚠️ ضع تكرار + عدد 
❗️لوضع تكرار بالعدد للمجموعه

⚠️️ قفل العربيه 
❗️لقفل اللغه العربيه بالمجموعه

️⚠️ قفل جهات الاتصال
❗️لقفل جهات الاتصال بالمجموعه

⚠️ قفل المعرف 
❗️ لقفل علامه ( @ ) بالمجموعه 

⚠️ قفل التاك 
❗️لقفل علامه ( # ) بالمجموعه

⚠️️ قفل الشارحه 
❗️لقفل علامه ( / ) بالمجموعه

⚠️️ قفل الاضافه 
❗️ لقفل الاضافه بالمجموعه 

⚠️ قفل الدردشه 
❗️لقفل الدردشه بالمجموعه

⚠️️ قفل الروابط 
❗️ لقفل الروابط بالمجموعه 

⚠️ قفل البوتات 
❗️ لقفل البوتات بالمجموعه 

⚠️️ قفل السمايل 
❗️ لقفل السمايلات بالمجموعه 

⚠️️ قفل الانلاين 
❗️ لقفل اللسته الشفافه بالمجموعه

🔸--------------------------🔹

✅ فتح اعاده توجيه 
❗️لفتح اعاده توجيه بالمجموعه

✅ فتح الكلايش 
❗️لفتح الكلايش بالمجموعه

✅ فتح التكرار 
❗️لفتح التكرار بالمجموعه

✅ فتح العربيه 
❗️لفتح اللغه العربيه بالمجموعه

✅ فتح  جهات الاتصال 
❗️لفتح جهات الاتصال بالمجموعه

✅ فتح المعرف 
❗️ لفتح علامه ( @ ) بالمجموعه 

✅ فتح التاك 
❗️ لفتح علامه ( # ) بالمجموعه
 
✅ فتح الشارحه 
❗️ لفتح علامه ( / ) بالمجموعه 

✅ فتح الاضافه 
❗️ لفتح الاضافه بالمجموعه
 
✅ فتح الدردشه 
❗️ لفتح الدردشه بالمجموعه 

✅ فتح الروابط 
❗️ لفتح الروابط بالمجموعه 

✅ فتح البوتات 
❗️لفتح البوتات بالمجموعه

✅ فتح السمايل 
❗️ لفتح السمايلات بالمجموعه 

✅ فتح الانلاين 
❗️ لفتح اللسته الشفافه بالمجموعه 
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------


 elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔹

🔺-️ ضع صوره
❗️لوضع صوره للمجموعه

🔺-️ ضع قوانين + القوانين
❗️لوضع قوانين للمجموعه

🔺-️ ضع وصف + الوصف 
❗️لوضع وصف للمجموعه 

🔺-️ ضع اسم + الاسم 
❗️لوضع اسم للمجموعه 

🔺-️ ضع  معرف + المعرف
❗️لوضع معرف للمجموعه

🔺-️ ضع رابط 
❗️لخزن رابط المجموعه بالبوت

🔺-️ الرابط 
❗️لاظهار رابط المجموعه المخزون 

🔺-️ معلوماتي 
❗️لعرض معلومات الشخص

🔺-️ معلومات المجموعه 
❗️لعرض معلومات المجموعه

🔺-️ اعدادات الوسائط
❗️لاظهار اعدادات الوسائط
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
-----------------------

 elseif  matches[1] == "م5" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔧 اوامـــر المــطـــوريـــن  ⚙
🔸--------------------------🔹

🕋-  تفعيل 
📿-  لتفعيل البوت بالمجموعه 

🕋-  تعطيل 
📿-  لتعطيل البوت بالمجموعه 

🕋-  رفع المدير 
📿-  لرفع المدير عن طريق الرد + معرف  

🕋-  وضع وقت + عدد الايام
📿- لتفعيل البوت ع عدد الايام

🕋- الوقت
📿- لمعرفت عدد ايام تفعيل البوت

🕋-  اذاعه 
📿- لنشر شئ بكل مجموعات البوت 

🕋- زحلك 
📿- لطرد البوت من المجموعه 

🕋-  جلب ملف + اسم الملف    
📿-  لجلب ملف من سيرفر البوت 

🕋- تفعيل + اسم الملف 
📿- لتفعيل ملف عن طريق البوت

🕋- تعطيل + اسم للملف
📿- لتعطيل ملف عن طريق البوت

🕋-  صنع مجموعه + الاسم 
📿- لصنع مجموعه بواسطه حساب البوت

🕋-  ترقيه سوبر  
📿- لترقيه المجموعه بواسطه حساب البوت
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)",
  },
  run = run
}
end


--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
