--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
do
function run(msg, matches)
  if matches[1] == "hall" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⏺-اهلا بكم هناك 5 اوامر في البوت🔸
🔸--------------------------🔹

🎈- /ha :- 
🔺- لعرض اوامر الادمنيه و المدير
🎈- /hm :- 
🔺- لعرض اوامر الميديا
🎈- /hc :- 
🔺- لعرض اوامر الحمايه
🎈- /hg
🔺- لعرض اوامر المجموعه
🎈- /hs :- 
🔺- لعرض اوامر المطورين
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif matches[1] == "ha" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔺- /add mod:- لرفع ادمن
🔺- /del mod :- لتنزيل ادمن
🔺- /add admin:- لرفع اداري
🔺- /del admin:- لتنزيل اداري
🔺-️ /ban :- لحظر العضو
🔺-️ /unban :- لأزاله الحظر
🔺-️ /bw :- لمنع كلمه
🔺-️ /ubw :- لالغاء منع كلمه 
🔺-️ /lbw :- لضهار الكلمات الممنوعه
🔺- /clbw :- لحذف الكلمات الممنوعه
🔺-️ /id :- لعرض ايدي المجموعه
🔺-️ /id :- لعرض ايدي العضو بلرد
🔺- /sil :- لكتم عضو
🔺- /list sil :- لظهار المكتومين
🔺- /bots :- لضهار بوتات api
🔺- /owner :- لظهار مدير المجموعه
🔺- /mods :- لظهار الادمنيه
🔺- /admins :- لظهار الادارين
🔺- cl :- لحذف رساله بلرد
🔺- /who :- لظهار اعضاء المجموعه
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------


  elseif  matches[1] == "hm" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔱 اوامـر قــفـل و فــتـح الــميديـا 🔱
🔸--------------------------🔹
✅ /c لقفل الامر
⚠️ /o لفتح الامر
🔸--------------------------🔹

🎈- au :- الصوتيات |🔊
🎈- ph :- الصور|🌠
🎈- vi :- الفديوهات|🎥
🎈- gi :- الصور المتحركه|🃏
🎈- dc :- الملفات|🗂
🎈- gp :- المجموعه|📢
🎈- tx :- الدردشه|📇
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif  matches[1] == "hc" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  📛اوامـــر حمـــايه الـــمجمـــوعه 📛
🔸--------------------------🔹
✅ /c لقفل الامر
⚠️ /o لفتح الامر
🔸--------------------------🔹

🎈- lk :- الروابط |♻️
🎈- sp :- السبام|🚸
🎈- fl :- التكرار|🔖
🎈- ar :- العربيه|🆎
🎈- mb :- الاعضاء|👥
🎈- rt :- الرتل|⚠️
🎈- st :- الملصقات|🏟
🎈- ct :- جهات الاتصال|📩
🎈- kc :- الطرد|🚷
🎈- us :- المعرف|🌀
🎈- ej :- الايموجي|😃
🎈- tg :- التاك|📥
🎈- fd :- اعاده توجيه|↪️
🎈- cm :- الشارحه|〰
🎈- ts :- الاشعارات|🚏
🎈- jo :- الدخول بالرابط|📍
  ]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------


 elseif  matches[1] == "hg" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔹

🔺-️ /set ph :- لوضع صوره للمجموعه
🔺-️ /set ru :- لوضع قوانين
🔺- /ru :- لضهار القوانين
🔺-️ /set ab :- لوضع وصف للمجموعه
🔺-️ /set na :- لوضع اسم للمجموعه
🔺- /set us :- لوضع معرف للمجموعه
🔺-️ /set lk :- لحفظ رابط المجموعه
🔺-️ /lk :- اظهار رابط المجموعه 
🔺- /set fl :- لتحديد التكرار {5-20}
🔺-️ /info :- لضهار معلوماتك
🔺-️ /gp info :- لضهار معلومات المجموعه
🔺- /s :- لضهار معلومات المجموعه

🔸--------------------------🔹

🔺- /cl :- لحذف ⤵️
🔺- ru :- القوانين
🔺- ab :- الوصف
🔺- us :- المعرف 
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
-----------------------

 elseif  matches[1] == "hs" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔧 اوامـــر المــطـــوريـــن  ⚙
🔸--------------------------🔹

🕋- /add :- لتفعيل البوت
🕋- /rem :- لتعطيل البوت
🕋- /add owner :- لرفع مدير
🕋- /br :- لذاعه شئ في المجموعات
🕋- /kb :- لطرد البوت من المجموعه
🕋- /send :- لجلب ملف من السيرفر    
🕋- /cg :- لصنع مجموعه
🕋- /tosuper :- لترقيه المجموعه
🕋- /set time :- لوضع وقت للبوت
🕋- /time :- لمعرفه وقت تفعيل البوت
🕋- /pall :- لعرض الملفات
🕋- /p ac :- لتفعيل ملف 
🕋- /p an :- لتعطيل ملف
🕋- /p a :- الملفات المثبته
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------
  elseif matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⏺-اهلا بكم هناك 5 اوامر في البوت🔸
🔸--------------------------🔹

🎈م1 : لعرض اوامر الادمنيه و المدير🎐

🎈م2 : لعرض اوامر الميديا🎐

🎈م3 : لعرض اوامر حماية 🎐

🎈م4 : لعرض اوامر المجموعه 🎐

🎈م5 : لعرض اوامر المطورين 🎐
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔺- رفع ادمن :- لرفع ادمن رد + معرف

🔺- تنزيل ادمن :- لرفع ادمن رد + معرف

🔺- رفع اداري:- لرفع اداري رد + معرف

🔺- تنزيل اداري:- لرفع اداري رد + معرف

🔺- حظر :- حظر عضو من المجموعه

🔺- الغاء حظر :- الغاء الحظر عن عضو

🔺- منع + الكلمه :- منع كلمه  

🔺-الغاء منع + الكلمه :- الغاء منع كلمه 

🔺--قائمه المنع:- اظهار الكلمات الممنوعه

🔺-تنظيف قائمه المنع:- لمسح كل المنع

🔺- ايدي :- عرض ايدي المجموعه
 
🔺-- ايدي بالرد :- عرض ايدي شخص 

🔺-كتم :- لكتم عضو رد + معرف + ايدي

🔺- المكتومين :- لعرض قائمه المكتومين
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔱 اوامـر قــفـل و فــتـح الــميديـا 🔱
🔸--------------------------🔹
قفل + الامر / للقفل ⚠️
فتح + الامر / للفتح  ✅
🔸--------------------------🔹

🎈- الصوت :-  |🔊
🎈- الصور :- |🌠
🎈- الفيديو :- |🎥
🎈- الصور المتحركه :- |🃏
🎈- الفايلات :- |🗂
🎈- المجموعه :- |📢
🎈- الدردشه :- |📇
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛اوامـــر حمـــايه الـــمجمـــوعه📛
🔸--------------------------🔹
قفل + الامر / للقفل ⚠️
فتح + الامر / للفتح  ✅
🔸--------------------------🔹

🎈- اعاده توجيه|↪️
🎈- الكلايش|🚸
🎈- التكرار|🔖

🎈- العربيه|🆎
🎈- جهات الاتصال|📩
🎈- المعرف|🌀
🎈- التاك|📥
🎈- الشارحه|〰

🎈- الاضافه|👥
🎈- الدردشه|🗣
🎈- الروابط|♻️
🎈- البوتات|✳️
🎈- السمايل|😃

🎈- الانلاين|📡
🎈- الاشعارات|🎌
🎈- الدخول بالرابط|📍
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------


 elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔹

🔺- ضع صوره :- لوضع صوره 

🔺- ضع قوانين:-لوضع قوانين 

🔺- ضع وصف :-لوضع وصف  

🔺- ضع اسم :- لوضع اسم  

🔺- ضع  معرف :- لوضع معرف 

🔺- ضع رابط :- لخزن رابط المجموعه

🔺- الرابط :- رابط المجموعه 

🔺- معلوماتي :- عرض معلوماتك

🔺-معلومات المجموعه:-عرض معلومات

🔺-اعدادت الوسائط:-اضهار الاعدادات
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
-----------------------

 elseif  matches[1] == "م5" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔧 اوامـــر المــطـــوريـــن  ⚙
🔸--------------------------🔹

🕋-  تفعيل 
📿-  لتفعيل البوت بالمجموعه 

🕋-  تعطيل 
📿-  لتعطيل البوت بالمجموعه 

🕋-  رفع المدير 
📿-  لرفع المدير عن طريق الرد + معرف  

🕋-  وضع وقت + عدد الايام
📿- لتفعيل البوت ع عدد الايام

🕋- الوقت
📿- لمعرفت عدد ايام تفعيل البوت

🕋-  اذاعه 
📿- لنشر شئ بكل مجموعات البوت 

🕋- زحلك 
📿- لطرد البوت من المجموعه 

🕋-  جلب ملف + اسم الملف    
📿-  لجلب ملف من سيرفر البوت 

🕋- تفعيل + اسم الملف 
📿- لتفعيل ملف عن طريق البوت

🕋- تعطيل + اسم للملف
📿- لتعطيل ملف عن طريق البوت

🕋-  صنع مجموعه + الاسم 
📿- لصنع مجموعه بواسطه حساب البوت

🕋-  ترقيه سوبر  
📿- لترقيه المجموعه بواسطه حساب البوت
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------
elseif  matches[1] == "مساعده" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔸--------------------------🔹
اهلا بكم في بوت تشاكي 🙂🎈

هناك نوعان من الاوامر

1⃣- الاوامر :- لضهار الاوامر العربيه

2⃣- /hall :- لضهار الاوامر بل انكليزيه
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n"
-----------------------
elseif  matches[1] == "help" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔸--------------------------🔹
اهلا بكم في بوت تشاكي 🙂🎈

هناك نوعان من الاوامر

1⃣- الاوامر :- لضهار الاوامر العربيه

2⃣- /hall :- لضهار الاوامر بل انكليزيه
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n"
  end
end
return {
  patterns = {
    "^(hall)",
    "^(ha)",
    "^(hm)",
    "^(hc)",
    "^(hg)",
    "^(hs)",
    "^(help)",
    "^[#!/](hall)",
    "^[#!/](ha)",
    "^[#!/](hm)",
    "^[#!/](hc)",
    "^[#!/](hg)",
    "^[#!/](hs)",
    "^[#!/](help)",
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^(مساعده)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)",
    "^[/!#](مساعده)"
  },
  run = run
}
end


--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
