--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
do
function run(msg, matches)
  if matches[1] == "hall" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⏺-اهلا بكم هناك 5 اوامر في البوت🔸
🔸--------------------------🔹

🎈- /ha :- 
🔺- لعرض اوامر الادمنيه و المدير
🎈- /hm :- 
🔺- لعرض اوامر الميديا
🎈- /hc :- 
🔺- لعرض اوامر الحمايه
🎈- /hg
🔺- لعرض اوامر المجموعه
🎈- /hs :- 
🔺- لعرض اوامر المطورين
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif matches[1] == "ha" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔺- /add mod:- لرفع ادمن
🔺- /del mod :- لتنزيل ادمن
🔺- /add admin:- لرفع اداري
🔺- /del admin:- لتنزيل اداري
🔺-️ /ban :- لحظر العضو
🔺-️ /unban :- لأزاله الحظر
🔺-️ /bw :- لمنع كلمه
🔺-️ /ubw :- لالغاء منع كلمه 
🔺-️ /lbw :- لضهار الكلمات الممنوعه
🔺- /clbw :- لحذف الكلمات الممنوعه
🔺-️ /id :- لعرض ايدي المجموعه
🔺-️ /id :- لعرض ايدي العضو بلرد
🔺- /sil :- لكتم عضو
🔺- /list sil :- لظهار المكتومين
🔺- /bots :- لضهار بوتات api
🔺- /owner :- لظهار مدير المجموعه
🔺- /mods :- لظهار الادمنيه
🔺- /admins :- لظهار الادارين
🔺- cl :- لحذف رساله بلرد
🔺- /who :- لظهار اعضاء المجموعه
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------


  elseif  matches[1] == "hm" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔱 اوامـر قــفـل و فــتـح الــميديـا 🔱
🔸--------------------------🔹
✅ /c لقفل الامر
❗️ /o لفتح الامر
🔸--------------------------🔹
🎈- au :- الصوتيات |🔊
🎈- ph :- الصور|🌠
🎈- vi :- الفديوهات|🎥
🎈- gi :- الصور المتحركه|🃏
🎈- dc :- الملفات|🗂
🎈- gp :- المجموعه|📢
🎈- tx :- الدردشه|📇
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif  matches[1] == "hc" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  📛اوامـــر حمـــايه الـــمجمـــوعه 📛
🔸--------------------------🔹
✅ /c لقفل الامر
❗️ /o لفتح الامر
🔸--------------------------🔹
🎈- lk :- الروابط |♻️
🎈- sp :- السبام|🚸
🎈- fl :- التكرار|🔖
🎈- ar :- العربيه|🆎
🎈- mb :- الاعضاء|👥
🎈- rt :- الرتل|⚠️
🎈- st :- الملصقات|🏟
🎈- ct :- جهات الاتصال|📩
🎈- kc :- الطرد|🚷
🎈- us :- المعرف|🌀
🎈- ej :- الايموجي|😃
🎈- tg :- التاك|📥
🎈- fd :- اعاده توجيه|↪️
🎈- cm :- الشارحه|〰
🎈- tga :- الاشعارات|🚏
🎈- jo :- الدخول بالرابط|📍
  ]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------


 elseif  matches[1] == "hg" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔹

🔺-️ /set ph :- لوضع صوره للمجموعه
🔺-️ /set ru :- لوضع قوانين
🔺- /ru :- لضهار القوانين
🔺-️ /set ab :- لوضع وصف للمجموعه
🔺-️ /set na :- لوضع اسم للمجموعه
🔺- /set us :- لوضع معرف للمجموعه
🔺-️ /set lk :- لحفظ رابط المجموعه
🔺-️ /lk :- اظهار رابط المجموعه 
🔺- /set fl :- لتحديد التكرار {5-20}
🔺-️ /info :- لضهار معلوماتك
🔺-️ /gp info :- لضهار معلومات المجموعه
🔺- /s :- لضهار معلومات المجموعه

🔸--------------------------🔹

🔺- /cl :- لحذف ⤵️
🔺- ru :- القوانين
🔺- ab :- الوصف
🔺- us :- المعرف 
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
-----------------------

 elseif  matches[1] == "hs" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔧 اوامـــر المــطـــوريـــن  ⚙
🔸--------------------------🔹

🕋- /add :- لتفعيل البوت
🕋- /rem :- لتعطيل البوت
🕋- /add owner :- لرفع مدير
🕋- /br :- لذاعه شئ في المجموعات
🕋- /kb :- لطرد البوت من المجموعه
🕋- /send :- لجلب ملف من السيرفر    
🕋- /cg :- لصنع مجموعه
🕋- /tosuper :- لترقيه المجموعه
🕋- /set time :- لوضع وقت للبوت
🕋- /time :- لمعرفه وقت تفعيل البوت
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n" 
------------------
  elseif matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
⏺-اهلا بكم هناك 5 اوامر في البوت🔸
🔸--------------------------🔹

🎈م1 : لعرض اوامر الادمنيه و المدير🎐

🎈م2 : لعرض اوامر الميديا🎐

🎈م3 : لعرض اوامر حماية 🎐

🎈م4 : لعرض اوامر المجموعه 🎐

🎈م5 : لعرض اوامر المطورين 🎐
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔰 اوامر تـخص الادمنيـه و المـديـر 🔰
🔸--------------------------🔹

🔺- رفع ادمن
❗لرفع ادمن عن طريق الرد + معرف

🔺- تنزيل ادمن
❗لتنزيل ادمن عن طريق الرد + معرف

🔺- رفع اداري
❗لرفع اداري عن طريق الرد + معرف

🔺- تنزيل اداري
❗لتنزيل اداري عن طريق الرد + معرف

🔺-️ حظر 
❗️لحظر وطرد عضو في المجموعه

🔺-️ الغاء حظر
❗️لالغاء الحظر عن عضو

🔺-️ منع + الكلمه 
❗️لمنع كلمه داخل بالمجموعه 

🔺-️ الغاء منع + الكلمه 
❗️لالغاء منع كلمه داخل بالمجموعه 

🔺-️ قائمه المنع 
❗️لاظهار  قائمه الكلمات الممنوعه

🔺-️ ايدي 
❗️لعرض ايدي المجموعه
 
🔺-️ ايدي بالرد 
❗️لعرض ايدي شخص بالمجموعه

🔺- تنظيف قائمه المنع 
❗️لمسح قائمه المنع 

🔺- كتم بالرد او معرف او الايدي
❗️لكتم عضو داخل المجموعه

🔺- المكتومين
❗️لعرض قائمه المكتومين
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔱 اوامـر قــفـل و فــتـح الــميديـا 🔱
🔸--------------------------🔹

⚠️ قفل الفيديو 
❗️ لقفل الفيديوهات بالمجموعه 

⚠️️ قفل الصور 
❗️ لقفل الصور بالمجموعه 

⚠️ قفل الصوت 
❗️ لقفل الصوت بالمجموعه 

⚠️ قفل الصور المتحركه 
❗️ لقفل الصور المتحركه بالمجموعه 

⚠️ قفل الملصقات 
❗️ لقفل الملصقات بالمجموعه 

🔸--------------------------🔹

✅ فتح الفيديو 
❗️ لفتح الفيديوهات بالمجموعه 

✅ فتح الصور 
❗️ لفتح الصور بالمجموعه 

✅ فتح الصوت 
❗️ لفتح الصوت بالمجموعه 

✅ فتح الصور المتحركه 
❗️ لفتح الصور المتحركه بالمجموعه 

✅ فتح الملصقات 
❗️ لفتح الملصقات بالمجموعه 
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛اوامـــر حمـــايه الـــمجمـــوعه📛
🔸--------------------------🔹

⚠️ قفل اعاده توجيه 
❗️️لقفل اعاده توجيه بالمجموعه

⚠️️ قفل الكلايش 
❗️ لقفل الكلايش بالمجموعه 

⚠️️ قفل التكرار 
❗️ لقفل التكرار بالمجموعه 

⚠️ ضع تكرار + عدد 
❗️لوضع تكرار بالعدد للمجموعه

⚠️️ قفل العربيه 
❗️لقفل اللغه العربيه بالمجموعه

️⚠️ قفل جهات الاتصال
❗️لقفل جهات الاتصال بالمجموعه

⚠️ قفل المعرف 
❗️ لقفل علامه ( @ ) بالمجموعه 

⚠️ قفل التاك 
❗️لقفل علامه ( # ) بالمجموعه

⚠️️ قفل الشارحه 
❗️لقفل علامه ( / ) بالمجموعه

⚠️️ قفل الاضافه 
❗️ لقفل الاضافه بالمجموعه 

⚠️ قفل الدردشه 
❗️لقفل الدردشه بالمجموعه

⚠️️ قفل الروابط 
❗️ لقفل الروابط بالمجموعه 

⚠️ قفل البوتات 
❗️ لقفل البوتات بالمجموعه 

⚠️️ قفل السمايل 
❗️ لقفل السمايلات بالمجموعه 

⚠️️ قفل الانلاين 
❗️ لقفل اللسته الشفافه بالمجموعه

⚠️️ قفل الاشعارات 
❗️ لقفل اشعارات الدخول بالرابط

⚠️️ قفل الدخول بالرابط 
❗️ لقفل الدخول عبر الرابط بالمجموعه

🔸--------------------------🔹

✅ فتح اعاده توجيه 
❗️لفتح اعاده توجيه بالمجموعه

✅ فتح الكلايش 
❗️لفتح الكلايش بالمجموعه

✅ فتح التكرار 
❗️لفتح التكرار بالمجموعه

✅ فتح العربيه 
❗️لفتح اللغه العربيه بالمجموعه

✅ فتح  جهات الاتصال 
❗️لفتح جهات الاتصال بالمجموعه

✅ فتح المعرف 
❗️ لفتح علامه ( @ ) بالمجموعه 

✅ فتح التاك 
❗️ لفتح علامه ( # ) بالمجموعه
 
✅ فتح الشارحه 
❗️ لفتح علامه ( / ) بالمجموعه 

✅ فتح الاضافه 
❗️ لفتح الاضافه بالمجموعه
 
✅ فتح الدردشه 
❗️ لفتح الدردشه بالمجموعه 

✅ فتح الروابط 
❗️ لفتح الروابط بالمجموعه 

✅ فتح البوتات 
❗️لفتح البوتات بالمجموعه

✅ فتح السمايل 
❗️ لفتح السمايلات بالمجموعه 

✅ فتح الانلاين 
❗️ لفتح اللسته الشفافه بالمجموعه 

✅ فتح الاشعارات 
❗️ لفتح اشعارات الدخول بالرابط 

✅ فتح الدخول بالرابط 
❗️ لفتح الدخول بالرابط بالمجموعه 
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------


 elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
🔸--------------------------🔹

🔺-️ ضع صوره
❗️لوضع صوره للمجموعه

🔺-️ ضع قوانين + القوانين
❗️لوضع قوانين للمجموعه

🔺-️ ضع وصف + الوصف 
❗️لوضع وصف للمجموعه 

🔺-️ ضع اسم + الاسم 
❗️لوضع اسم للمجموعه 

🔺-️ ضع  معرف + المعرف
❗️لوضع معرف للمجموعه

🔺-️ ضع رابط 
❗️لخزن رابط المجموعه بالبوت

🔺-️ الرابط 
❗️لاظهار رابط المجموعه المخزون 

🔺-️ معلوماتي 
❗️لعرض معلومات الشخص

🔺-️ معلومات المجموعه 
❗️لعرض معلومات المجموعه

🔺-️ اعدادات الوسائط
❗️لاظهار اعدادات الوسائط
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
-----------------------

 elseif  matches[1] == "م5" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔧 اوامـــر المــطـــوريـــن  ⚙
🔸--------------------------🔹

🕋-  تفعيل 
📿-  لتفعيل البوت بالمجموعه 

🕋-  تعطيل 
📿-  لتعطيل البوت بالمجموعه 

🕋-  رفع المدير 
📿-  لرفع المدير عن طريق الرد + معرف  

🕋-  وضع وقت + عدد الايام
📿- لتفعيل البوت ع عدد الايام

🕋- الوقت
📿- لمعرفت عدد ايام تفعيل البوت

🕋-  اذاعه 
📿- لنشر شئ بكل مجموعات البوت 

🕋- زحلك 
📿- لطرد البوت من المجموعه 

🕋-  جلب ملف + اسم الملف    
📿-  لجلب ملف من سيرفر البوت 

🕋- تفعيل + اسم الملف 
📿- لتفعيل ملف عن طريق البوت

🕋- تعطيل + اسم للملف
📿- لتعطيل ملف عن طريق البوت

🕋-  صنع مجموعه + الاسم 
📿- لصنع مجموعه بواسطه حساب البوت

🕋-  ترقيه سوبر  
📿- لترقيه المجموعه بواسطه حساب البوت
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH '..'\n'
.."msg : "..msg.text.."\n" 
------------------
elseif  matches[1] == "مساعده" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔸--------------------------🔹
اهلا بكم في بوت تشاكي 🙂🎈

هناك نوعان من الاوامر

1⃣- الاوامر :- لضهار الاوامر العربيه

2⃣- /hall :- لضهار الاوامر بل انكليزيه
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n"
-----------------------
elseif  matches[1] == "help" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔸--------------------------🔹
اهلا بكم في بوت تشاكي 🙂🎈

هناك نوعان من الاوامر

1⃣- الاوامر :- لضهار الاوامر العربيه

2⃣- /hall :- لضهار الاوامر بل انكليزيه
]].."\n"
.."🔸--------------------------🔹".."\n"
..'🔺- CH - @lTSHAKEl_CH'..'\n'
.."msg : "..msg.text.."\n"
  end
end
return {
  patterns = {
    "^(hall)",
    "^(ha)",
    "^(hm)",
    "^(hc)",
    "^(hg)",
    "^(hs)",
    "^(help)",
    "^[#!/](hall)",
    "^[#!/](ha)",
    "^[#!/](hm)",
    "^[#!/](hc)",
    "^[#!/](hg)",
    "^[#!/](hs)",
    "^[#!/](help)",
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^(مساعده)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)",
    "^[/!#](مساعده)"
  },
  run = run
}
end


--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
