-- made by { @lI_XxX_Il } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلو"   --msg 
rs[1] = " هــﮧ✥ـٍہٰٓـ๋͜لاـوات🦀❤️ "    --replaY 

ws[2] = "تشاكي" 
rs[2] = " نـﮧ✥ـٍعٰٓـ๋͜م تفضل🕷❤️ " 

ws[3] = "هلا" 
rs[3] = " هــﮧ✥ـٍہٰٓـ๋͜لاـ بيك🦀❤️ " 

ws[4] = "شلونك" 
rs[4] = " تٰمـہام ⚘║␙ 🎅🏿🐾 وانٓــت ࿐❥🐚💛 " 

ws[5] = "شلونكم"   --msg 
rs[5] = " آلـْ ح ـمـِْدِّ اللّـٰھ وانٓــتــٰـہ ࿐❥ 🌎🌸 "  --reply 

ws[6] = "تمام" 
rs[6] = " دۈۋم يّےـآٱآرب ↜┇✥ 💁🏿‍♂️👅 " 
ws[7] = "دوم" 
rs[7] = " פـبـ⚘ـيبي 💓💧 " 

ws[8] = "تخليني" 
rs[8] = " ؏ راسي🌝🦀 " 

ws[9] = "هلاو" 
rs[9] = " هــﮧ✥ـٍہٰٓـ๋͜لاـوات  حـٰ« ࿐❥ـبي 🐹💧 " 
ws[10] = "🌝" 
rs[10] = " منﮩﮩﮩﮩور🌝🦀 " 

ws[11] = "انجب" 
rs[11] = " صﮩﮩار ستادي🐸🍃 " 

ws[12] = "احبك" 
rs[12] = " פـبـ⚘ـيبي 💓💧 وني هم😻🦀 " 

ws[13] = "اكرهك" 
rs[13] = " ديله شلون اطيق خلقتك اني😾🖖🏿🕷 " 

ws[14] = "تحبني" 
rs[14] = " مادري افڱﮩﮩﮩر🐸💔 " 

ws[15] = "محمد" 
rs[15] = " ڤڍ ﯿتﮩه😻🦀🍃 " 

ws[16] = "حسين" 
rs[16] = " ﯿمه ﯿمه الثكيل ڤڍ ﯿتﮩه😻🦀🍃 " 

ws[17] = "مودي" 
rs[17] = " פـبـ⚘ـيبي 💓💧 هاذ ورده الكروب🙇🏻❤️ " 

ws[18] = "كسمك" 
rs[18] = " مال امك لوردي شايفه🌝👄 " 

ws[19] = "سيف" 
rs[19] = " #تجراسك مشغول هسه🌝🦀❤️ " 

ws[20] = "🌚" 
rs[20] = " ڤڍ  ﯿت ڝخٲﻣك😻🕷👄 " 

ws[21] = "😐" 
rs[21] = " ﺸبﯿك صۜافن ؏ خالتك😹🙇🏻❤️ " 

ws[22] = "🙄" 
rs[22] = " ؏ينڱ نژله اﺨاف عليك/ﭻ 🙇🏻💚 " 

ws[23] = "😒" 
rs[23] = "شــبيگ •┇✞🐤💦 حـٰ« ࿐❥ـبي 🐹💧 " 

ws[24] = "اريد بوت" 
rs[24] = " تعال هنا🌝👄 @lls_bot " 

ws[25] = "وين المدير" 
rs[25] = " ڸﯿﺸ شتريد🙄💔🍃 " 

ws[26] = "اه" 
rs[26] = "راح افوته واريحك 🐺🍆" 

ws[27] = "باي" 
rs[27] = "وين مولي خلينه بتونسين 🔇🚷" 

ws[28] = "كفو" 
rs[28] = "اله كفو يبو لضلوع اه 😻😹" 

ws[29] = "فرخ" 
rs[29] = "وينه خلي احصره ؟🙊😹" 

ws[30] = "شباب" 
rs[30] = "نعم حبي!!🙇🏿💜"

ws[31] = "حسون"
rs[31] = "فديته لصاك اخ لو بس يخليني😔😹😹💜"

ws[32] = "ام حسين"
rs[32] = "هاي حبيبت سيف ليندك بيه اشكه؟"

ws[33] = "فديت"
rs[33] = "فداك كوني وثنين عيوني 🌝💜"

ws[34] = "خاص"
rs[34] = "اثكل حبي لضل ساحف؟😔😹"

ws[35] = "تعال خاص"
rs[35] = "بله حشوفه صوره يابنيه كلههن زي لخرا🌝😹"

ws[36] = "تعالي خاص"
rs[36] = "اهوو ضل ضل ساحف كبر طمك😔😹❤️"

ws[37] = "زاحف"
rs[37]  = "زاحف ع اختك؟ كضيت عمرك جرجف🌝😹😹🌝كضيت عمرك زحف تره"

ws[38] = "دي"
rs[38] = "خليني احہۣۗبہۣۜۧ😻ہۣۛۖہۣۖۗڱֆ ̮⇣  🌝💔"

ws[39] = "😳"
rs[39] = "ها بس لا شفت خالتك الشكره 😳😹🕷"

ws[40] = "😕"
rs[40] = "تعال اشكيلي اهمومك ليش ضايج 🙁😭💔"

ws[41] = "🚶🏿💔"
rs[41] = "تعال اشكيلي اهمومك ليش ضايج 🙁😭💔"

ws[42] = "غني"
rs[42] = "اي مو كدامك مغني قديم 😒🎋 هوه ﴿↜ انـِۨـۛـِۨـۛـِۨيـُِـٌِہۧۥۛ ֆᵛ͢ᵎᵖ ⌯﴾❥  ربي كامز و تكلي غنيلي 🙄😒🕷 آإرۈحُـ✯ـہ✟  😴أنــ💤ــااااام😴  اشرف تالي وكت يردوني اغني 😒☹️🚶"

ws[43] = "هاي"
rs[43] = "هايہۣۜۧ😻اہۣۖۗتֆ ̮⇣ يروہۣۗحہيۣֆ ﴿  ❁¹°↜إنـِۧـۣۧتِـِۨـۘهہْ ۦ ֆᵛ͢ᵎᵖ ⌯﴾❥ 🎐😽😻"

ws[44] = "بوت"
rs[44] = "اول شي ولد لو بنيه؟ ثاني شي اذا ولد  امشطلعبرا وذا بنيه حياتي تعاي خاص موضوع حساس عندي😪🌚😹"

ws[45] = "الدنيه شنو"
rs[45] = "كحبه تضحك بس للكواويد يخوي كفو منك ع راسي🙂💜"

ws[46] = "🙂"
rs[46] = "ثكيل علساس هه😪🌚"

ws[47] = "طبعاا"
rs[47] = "#تجراسي والله تحتاج شي؟☹️💜😹"

ws[48] = "منو المطور"
rs[48] = "@li_XxX_il"

ws[49] = "يا فيصل"
rs[49] = "تخليني🐸😹"

ws[50] = "بخير"
rs[50] = "دومك/ج بخير يروحي انته/ي 😻😽"

ws[51] = "شسمك"
rs[51] = "تجراسك وكحبي اسمي تيبارا"

ws[52] = "شنو اسم البوت"
rs[52] = "صكاركم تيبارا"

ws[53] = "افلش"
rs[53] = "حته ارجعك بمك حبي🌝💋"

ws[54] = "منحرف"
rs[54] = "وينه خلي اصادق اخته وكسر عينه😔😹"

ws[55] = "واكف"
rs[55] = "بنلخرا وين واكف😐"

ws[56] = "اريد اكبل"
rs[56] = "شـًٍـًٍوــًٍـًٍفـًٍــًٍـًٍلـًٍلًٍي وياك حديقه ودايح رسمي 🙇🏿💜😹"

ws[57] = "بنيه"
rs[57] = "وينه خلي تجيني واتس نتونس🌝💜"

ws[58] = "لتزحف"
rs[58] = "دعوفه زاحف ع خالتك خلي يستفاد😕😹🙊"

ws[59] = "هم يجي يوم تعوفني"
rs[59] = "لأ يخوي تشه‍ه‍ه‍د الدنيه احبگ؟موت احپگ يلحپيپ💜🍃"

ws[60] = "هينه بمكاني"
rs[60] = "طيز مطيزه عير مفرزه عير يفتر وره الطيز  دبه دهن دبه كريز ابن العاهره ابن الكايمه ابن التشيله وهيه نايمه ابن ام البلاوي امك تشيل حته الخصاوي اخت التبلع ابن الترضع ابن التمص وماتشبع عير يطب وعير يطلع ادري طِيِّﺰ لو مقلع بس انت اصلك ماتشبع"

ws[61] = "اكسر عينه هسه"
rs[61] = "ابن الهايمة ابن الكايمة ابن التمصة وهية نايمة ابن العاهرة السكسية ابن الشرموطة التكعد ع العير وتسوي موطة امك ترجع ع العير بدون مرايات وشايفة العير اكثر من المطهرجي وماخذة وية العير صورة ولاعبة علية جقة شبر اليوم انيجك نيجت القرد واخليك مشمور بالبرد انيجك نيجت الحمار شرط بالليل مو بالنهار انيجك نيجة البعير وانطيك عير ستيل فوتة للاخير واطلع من طيزك خنزير "

ws[62] = "كافي حب"
rs[62] = "صار تاج راسي شوكت متريد انيجهم حاظر اني🙊❤️"

ws[63] = "غنيلي"
rs[63] = "لا تظربني لا تظرب 💃💃 كسرت الخيزارانه💃🎋 صارلي سنه وست اشهر💃💃 من ظربتك وجعانه🤒😹 اه اه"

ws[64] = "مكوم"
rs[64] = "ستادي حكه بيهم كلهم فروخ وكحاب بس يستشرفون وداعتك😞🤘🏿"

ws[65] = "تنح"
rs[65] = "من يصير عندك عود اتنح دي فرخي😸🤘🏿"

ws[66] = "جوني"
rs[66] = "#تجراسنه وحامي اعراضنه ويحب مايا وف يوميه اضرب عليهم 😞💋"

ws[67] = "كلخرا"
rs[67] = "خرا ليترس حلكك/ج ياخرا يابنلخرا خختفووو ابلع😸🙊💋"

ws[68] = "ضوجه"
rs[68] = "باع نغل يكول ضوجه حته لبنات ينتبهن ويزحفلهن ويتنايجون واني اضل احمي هنا شعب خخرا😒💔🤘🏿"

ws[69] = "الدنيه للتهواك تمطر؟"
rs[69] = "كساسه كساسه مطرت عليه بعير شكبر راسه وشكرا😞❤️💋"
-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "li_xXx_il" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @li_xXx_il" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end
