--[[ 
        _    _       _    _____     _____ ____    ____
       / \  / \     / \  | ____|___|_   _| /_\ \ / __ \     Đєⱴ 💀: @MaEsTrO_0
      / / \/ / \   / _ \ |  _| / __| | | | |_\_/| |  | |    Đєⱴ 💀: @devmaestr0
     / / \ \/ \ \ / ___ \| |___\__ \ | | | | \ \| |__| |    Đєⱴ ฿๏ͳ💀: @iqMaestroBot
    /_/   \/   \_/_/   \_|_____|___/ |_| |_|  \_\\____/     Đєⱴ ฿๏ͳ💀: @maestr0bot
                   Đєⱴ Ϲḫ₳ͷͷєℓ💀: @DevMaestro
—]]
do

function run(msg, matches)
return [[
🎀️البوت الذي يعمل على مجموعات السوبر 
🎀 يعمل البوت على مجموعات سوبر تصل الى 5K عضو 
   ≪ تم صنع البوت بواسطه المطورين ≫
   
             『  💯-Đєⱴ☠: @maestr0bot
             💯-Đєⱴ ☠: @iqMaestroBot
             』 Ϲḫ₳ͷͷєℓ☠: @DevMaestro
                      
                      
🎀️كل ما هو جديد على قناه السورس 
                      
                      [ @DevMaestro ]
                      
🎀 للاستفسار راسل المطورين :                                     
💯-Đєⱴ☠: @devmaestr0
💯-Đєⱴ☠: @MaEsTrO_0
💯-Ϲḫ₳ͷͷєℓ☠: @DevMaestro                     
                     🎀
            
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
