--[[ 
        _    _       _    _____     _____ ____    ____
       / \  / \     / \  | ____|___|_   _| /_\ \ / __ \     Đєⱴ 💀: @MaEsTrO_0
      / / \/ / \   / _ \ |  _| / __| | | | |_\_/| |  | |    Đєⱴ 💀: @devmaestr0
     / / \ \/ \ \ / ___ \| |___\__ \ | | | | \ \| |__| |    Đєⱴ ฿๏ͳ💀: @iqMaestroBot
    /_/   \/   \_/_/   \_|_____|___/ |_| |_|  \_\\____/     Đєⱴ ฿๏ͳ💀: @maestr0bot
                   Đєⱴ Ϲḫ₳ͷͷєℓ💀: @DevMaestro
—]]
local function pre_process(msg) 
local mae1 = 'maestro1:'..msg.to.id      
local mae2 = 'maestro2:'..msg.to.id
local mae4 = 'maestro4:'..msg.to.id    
local mae5 = 'maestro5:'..msg.to.id 
local mae3 = 'maestro3:'..msg.to.id  
local mae6 = 'maestro6:'..msg.to.id        --@DevMaestro
local mae7 = 'maestro7:'..msg.to.id
local mae8 = 'maestro8:'..msg.to.id     
local mae9 = 'maestro9:' ..msg.to.id
local mae10 = 'maestro10:'..msg.to.id
local mae11 = 'maestro11:'..msg.to.id
local mae12 = 'maestro12:'..msg.to.id
local ma = msg.text:match("/")
local ms = msg.text:match("😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃👫👪👬👭💏💑👯🙆🙅💁🙋💆💇💅👰🙎🙍🙇🎩👑👒👟👞👡👠👢👕👔👚👗🎽👖👘👙💼👜👝👛👓🎀🌂💄💛💙💜💚❤️💔💗💓💕💖💞💘💌💋💍💎👤👥💬👣💭🐶🐺🐱🐭🐹🐰🐸🐯🐨🐻🐷🐽🐮🐗🐵🐒🐴🐑🐘🐼🐧🐦🐤🐥🐣🐔🐍🐢🐛🐝🐜🐞🐌🐙🐚🐠🐟🐬🐳🐋🐄🐏🐀🐃🐅🐇🐉🐎🐐🐓🐕🐖🐁🐂🐲🐡🐊🐫🐪🐆🐈🐩🐾💐🌸🌷🍀🌹🌻🌺🍁🍃🍂🌿🌾🍄🌵🌴🌲🌳🌰🌱🌼🌐🌞🌝🌚🌑🌒🌓🌔🌕🌖🌗🌘🌜🌛🌙🌍🌎🌏🌋🌌🌠⭐️☀️⛅️☁️⚡️☔️❄️⛄️🌀🌁🌈🌊🎍💝🎎🎒🎓🎏🎆🎇🎐🎑🎃👻🎅🎄🎁🎋🎉🎊🎈🎌🔮🎥📷📹📼💿📀💽💾💻📱☎️📞📟📠📡📺📻🔊🔉🔈🔇🔔🔕📢📣⏳⌛️⏰⌚️🔓🔒🔏🔐🔑🔎💡🔦🔆🔅🔌🔋🔍🛁🛀🚿🚽🔧🔩🔨🚪🚬💣🔫🔪💊💉💰💴💵💷💶💳💸📲📧📥📤✉️📩📨📯📫📪📬📭📮📦📝📄📃📑📊📈📉📜📋📅📆📇📁📂✂️📌📎✒️✏️📏📐📕📗📘📙📓📔📒📚📖🔖📛🔬🔭📰🎨🎬🎤🎧🎼🎵🎶🎹🎻🎺🎷🎸👾🎮🃏🎴🀄️🎲🎯🏈🏀⚽️⚾️🎾🎱🏉🎳⛳️🚵🚴🏁🏇🏆🎿🏂🏊🏄🎣☕️🍵🍶🍼🍺🍻🍸🍹🍷🍴🍕🍔🍟🍗🍖🍝🍛🍤🍱🍣🍥🍙🍘🍚🍜🍲🍢🍡🍳🍞🍩🍮🍦🍨🍧🎂🍰🍪🍫🍬🍭🍯🍎🍏🍊🍋🍒🍇🍉🍓🍑🍈🍌🍐🍍🍠🍆🍅🌽🏠🏡🏫🏢🏣🏥🏦🏪🏩🏨💒⛪️🏬🏤🌇🌆🏯🏰⛺️🏭🗼🗾🗻🌄🌅🌃🗽🌉🎠🎡⛲️🎢🚢⛵️🚤🚣⚓️🚀✈️💺🚁🚂🚊🚉🚞🚆🚄🚅🚈🚇🚝🚋🚃🚎🚌🚍🚙🚘🚗🚕🚖🚛🚚🚨🚓🚔🚒🚑🚐🚲🚡🚟🚠🚜💈🚏🎫🚦🚥⚠️🚧🔰⛽️🏮🎰♨️🗿🎪🎭📍🚩🇯🇵🇰🇷🇩🇪🇨🇳🇺🇸🇫🇷🇪🇸🇮🇹🇷🇺🇬🇧1⃣2⃣3⃣4⃣5⃣6⃣7⃣8⃣9⃣0⃣🔟🔢#⃣🔣⬆️⬇️⬅️➡️🔠🔡🔤↗️↖️↘️↙️↔️↕️🔄◀️▶️🔼🔽↩️↪️ℹ️⏪⏩⏫⏬⤵️⤴️🆗🔀🔁🔂🆕🆙🆒🆓🆖📶🎦🈁🈯️🈳🈵🈴🈲🉐🈹🈺🈶🈚️🚻🚹🚺🚼🚾🚰🚮🅿️♿️🚭🈷🈸🈂Ⓜ️🛂🛄🛅🛃🉑㊙️㊗️🆑🆘🆔🚫🔞📵🚯🚱🚳🚷🚸⛔️✳️❇️❎✅✴️💟🆚📳📴🅰🅱🆎🅾💠➿♻️♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️♒️♓️⛎🔯🏧💹💲💱©®™❌‼️⁉️❗️❓❕❔⭕️🔝🔚🔙🔛🔜🔃🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕖🕗🕘🕙🕚🕡🕢🕣🕤🕥🕦✖️➕➖➗♠️♥️♣️♦️💮💯✔️☑️🔘🔗➰〰〽️🔱◼️◻️◾️◽️▪️▫️🔺🔲🔳⚫️⚪️🔴🔵🔻⬜️⬛️🔶🔷🔸🔹😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃👫👪👬👭💏💑👯🙆🙅💁🙋💆💇💅👰🙎🙍🙇🎩👑👒👟👞👡👠👢👕👔👚👗🎽👖👘👙💼👜👝👛👓🎀🌂💄💛💙💜💚❤️💔💗💓💕💖💞💘💌💋💍💎👤👥💬👣💭🐶🐺🐱🐭🐹🐰🐸🐯🐨🐻🐷🐽🐮🐗🐵🐒🐴🐑🐘🐼🐧🐦🐤🐥🐣🐔🐍🐢🐛🐝🐜🐞🐌🐙🐚🐠🐟🐬🐳🐋🐄🐏🐀🐃🐅🐇🐉🐎🐐🐓🐕🐖🐁🐂🐲🐡🐊🐫🐪🐆🐈🐩🐾💐🌸🌷🍀🌹🌻🌺🍁🍃🍂🌿🌾🍄🌵🌴🌲🌳🌰🌱🌼🌐🌞🌝🌚🌑🌒🌓🌔🌕🌖🌗🌘🌜🌛🌙🌍🌎🌏🌋🌌🌠⭐️☀️⛅️☁️⚡️☔️❄️⛄️🌀🌁🌈🌊🎍💝🎎🎒🎓🎏🎆🎇🎐🎑🎃👻🎅🎄🎁🎋🎉🎊🎈🎌🔮🎥📷📹📼💿📀💽💾💻📱☎️📞📟📠📡📺📻🔊🔉🔈🔇🔔🔕📢📣⏳⌛️⏰⌚️🔓🔒🔏🔐🔑🔎💡🔦🔆🔅🔌🔋🔍🛁🛀🚿🚽🔧🔩🔨🚪🚬💣🔫🔪💊💉💰💴💵💷💶💳💸📲📧📥📤✉️📩📨📯📫📪📬📭📮📦📝📄📃📑📊📈📉📜📋📅📆📇📁📂✂️📌📎✒️✏️📏📐📕📗📘📙📓📔📒📚📖🔖📛🔬🔭📰🎨🎬🎤🎧🎼🎵🎶🎹🎻🎺🎷🎸👾🎮🃏🎴🀄️🎲🎯🏈🏀⚽️⚾️🎾🎱🏉🎳⛳️🚵🚴🏁🏇🏆🎿🏂🏊🏄🎣☕️🍵🍶🍼🍺🍻🍸🍹🍷🍴🍕🍔🍟🍗🍖🍝🍛🍤🍱🍣🍥🍙🍘🍚🍜🍲🍢🍡🍳🍞🍩🍮🍦🍨🍧🎂🍰🍪🍫🍬🍭🍯🍎🍏🍊🍋🍒🍇🍉🍓🍑🍈🍌🍐🍍🍠🍆🍅🌽🏠🏡🏫🏢🏣🏥🏦🏪🏩🏨💒⛪️🏬🏤🌇🌆🏯🏰⛺️🏭🗼🗾🗻🌄🌅🌃🗽🌉🎠🎡⛲️🎢🚢⛵️🚤🚣⚓️🚀✈️💺🚁🚂🚊🚉🚞🚆🚄🚅🚈🚇🚝🚋🚃🚎🚌🚍🚙🚘🚗🚕🚖🚛🚚🚨🚓🚔🚒🚑🚐🚲🚡🚟🚠🚜💈🚏🎫🚦🚥⚠️🚧🔰⛽️🏮🎰♨️🗿🎪🎭📍🚩🇯🇵🇰🇷🇩🇪🇨🇳🇺🇸🇫🇷🇪🇸🇮🇹🇷🇺🇬🇧1⃣2⃣3⃣4⃣5⃣6⃣7⃣8⃣9⃣0⃣🔟🔢#⃣🔣⬆️⬇️⬅️➡️🔠🔡🔤↗️↖️↘️↙️↔️↕️🔄◀️▶️🔼🔽↩️↪️ℹ️⏪⏩⏫⏬⤵️⤴️🆗🔀🔁🔂🆕🆙🆒🆓🆖📶🎦🈁🈯️🈳🈵🈴🈲🉐🈹🈺🈶🈚️🚻🚹🚺🚼🚾🚰🚮🅿️♿️🚭🈷🈸🈂Ⓜ️🛂🛄🛅🛃🉑㊙️㊗️🆑🆘🆔🚫🔞📵🚯🚱🚳🚷🚸⛔️✳️❇️❎✅✴️💟🆚📳📴🅰🅱🆎🅾💠➿♻️♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️♒️♓️⛎🔯🏧💹💲💱©®™❌‼️⁉️❗️❓❕❔⭕️🔝🔚🔙🔛🔜🔃🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕖🕗🕘🕙🕚🕡🕢🕣🕤🕥🕦✖️➕➖➗♠️♥️♣️♦️💮💯✔️☑️🔘🔗➰〰〽️🔱◼️◻️◾️◽️▪️▫️🔺🔲🔳⚫️⚪️🔴🔵🔻⬜️⬛️🔶🔷🔸🔹😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃")
local mr = msg.text:match("@") 
local mo = msg.text:match("#")
local mt = msg.text:match("[Hh][Tt][Tt][Pp][Ss]://") or msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]%.[Mm][Ee]/") or msg.text:match("[Tt][Ll][Gg][Rr][Mm]%.[Mm][Ee]/") or msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]%.[Oo][Rr][Gg]") or msg.text:match("[Gg][Oo][Oo]%.[Gg][Li]/")  or msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]%.[Mm][Ee]") or msg.text:match("(https://t.me/)") or msg.text:match("[Tt].[Mm][Ee]/")
if redis:get(mae1) and not is_momod(msg) and mt then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الروابط  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae7) and not is_momod(msg) and mr then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال المعرفات  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae10) and not is_momod(msg) and mo then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 عمل تاك  في المجموعه  🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae2) and not is_momod(msg) and msg.fwd_from then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 عمل التوجيه  في المجموعه 🏌\n#العضو @'..msg.from.username)
elseif redis:get(mae4) and not is_momod(msg) and msg.media and msg.media.type == 'photo' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الصور  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae5) and not is_momod(msg) and msg.media and msg.media.type == 'audio' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الصوت  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae3) and not is_momod(msg) and msg.media and msg.media.type == 'video' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الفيديو  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae12) and not is_momod(msg) and ms then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال #السمايلات  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae6) and not is_momod(msg) and msg.to.type == 'channel' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 الدردشه  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae8) and not is_momod(msg) and ma then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الشارحه  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae9) and not is_momod(msg) and msg.text == '[unsupported]' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الانلاين  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
elseif redis:get(mae11) and not is_momod(msg) and msg.media then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), 'تحذير ❌\nممنوع🚫 ارسال الميديا  في المجموعه 🏌\n#العضو @'..msg.from.username or '')
return "done"
   end 
   return msg
 end
 
 
local function DevMaestro(msg, matches) 
    chat_id =  msg.to.id 
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الروابط' then
   local mae1 = 'maestro1:'..msg.to.id  
    redis:set(mae1, true)
return 'تم قفل🔐 الروابط بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الروابط' then
   local mae1 = 'maestro1:'..msg.to.id  
    redis:del(mae1)
return 'تم فتح🔓الروابط بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
        
end

if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'التوجيه' then
   local mae2 = 'maestro2:'..msg.to.id  
    redis:set(mae2, true)
return 'تم قفل🔐 التوجيه بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'التوجيه' then
   local mae2 = 'maestro2:'..msg.to.id 
    redis:del(mae2)
return 'تم فتح🔓 التوجيه بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الصور' then
  local mae4 = 'maestro4:'..msg.to.id 
    redis:set(mae4, true)
return 'تم قفل🔐 الصور بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الصور' then
    local mae4 = 'maestro4:'..msg.to.id 
    redis:del(mae4)
return 'تم فتح🔓 الصور بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الصوت' then
   local mae5 =  'maestro5:'..msg.to.id 
    redis:set(mae5, true)
return 'تم قفل🔐الصوت بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الصوت' then
  local mae5 =  'maestro5:'..msg.to.id 
    redis:del(mae5) 
return 'تم فتح🔓 الصوت بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الفيديو' then
  local mae3 = 'maestro3:'..msg.to.id
    redis:set(mae3, true)
return 'تم قفل🔐 الفيديو بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الفيديو'  then
 local mae3 = 'maestro3:'..msg.to.id
    redis:del(mae3) 
return 'تم فتح🔓 الفيديو بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الدردشه'  then
 local mae6 = 'maestro6:'..msg.to.id
    redis:set(mae6, true)
return 'تم قفل🔐 الدردشه بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الدردشه'  then
 local mae6 = 'maestro6:'..msg.to.id
    redis:del(mae6) 
return 'تم فتح🔓 الدردشه بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'المعرف'  then
 local mae7 = 'maestro7:'..msg.to.id
    redis:set(mae7, true)
return 'تم قفل🔐 المعرف بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'المعرف'  then
local mae7 = 'maestro7:'..msg.to.id
    redis:del(mae7) 
return 'تم فتح🔓 المعرف بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end

if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الشارحه'  then
  local mae8 = 'maestro8:'..msg.to.id
    redis:set(mae8, true)
return '#تم✔️ قفل🔐 الشارحه بالتحذير  في  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الشارحه'  then
   local mae8 = 'maestro8:'..msg.to.id
    redis:del(mae8)
return 'تم فتح🔓 الشارحه بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الانلاين' then
  local mae9 = 'maestro9:' ..msg.to.id
    redis:set(mae9, true)
return 'تم قفل🔐 الانلاين بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الانلاين' then
  local mae9 = 'maestro9:' ..msg.to.id
    redis:del(mae9)  
return 'تم فتح🔓 الانلاين بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'التاك' then
  local mae10 = 'maestro10:'..msg.to.id
    redis:set(mae10, true)
return 'تم قفل🔐التاك بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'التاك' then
 local mae10 = 'maestro10:'..msg.to.id
    redis:del(mae10) 
return 'تم فتح🔓 التاك بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'السمايل'  then
 local  mae12 = 'maestro12:'..msg.to.id
    redis:set(mae12, true)
return 'تم قفل🔐 السمايل بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]==  'السمايل'  then
 local  mae12 = 'maestro12:'..msg.to.id
    redis:del(mae12)  
return 'تم فتح🔓 السمايل بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الميديا'  then
 local  mae11 = 'maestro11:'..msg.to.id
    redis:set(mae11, true)
return 'تم قفل🔐 الميديا بالتحذير  في المجموعة '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]==  'الميديا'  then
 local  mae11 = 'maestro11:'..msg.to.id
    redis:del(mae11)  
return 'تم فتح🔓 الميديا بالتحذير  في المجموعة  '..msg.to.title..' \nبواسطة 🏌 (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
----------الاعدادات-------------

if matches[1] == "اعدادات القفل" and is_momod(msg) then
local mae1 = 'maestro1:'..msg.to.id     
local mae2 = 'maestro2:'..msg.to.id
local mae4 = 'maestro4:'..msg.to.id   
local mae5 = 'maestro5:'..msg.to.id 
local mae3 = 'maestro3:'..msg.to.id
local mae6 = 'maestro6:'..msg.to.id
local mae7 = 'maestro7:'..msg.to.id                              --@DevMaestro
local mae8 = 'maestro8:'..msg.to.id     
local mae9 = 'maestro9:' ..msg.to.id
local mae10 = 'maestro10:'..msg.to.id
local mae11 = 'maestro11:'..msg.to.id
local  mae12 = 'maestro12:'..msg.to.id
-- -- -- --
local settings = 'اعدادات القفل في المجموعة\n'..msg.to.title..'\n'
.."(📌) #الانلاين"..(redis:get(mae9) or "false").."\n"
.."(📸)#الصور"..(redis:get(mae4) or "false").."\n"
.."(🔊)#الصوت "..(redis:get(mae5) or "false").."\n\n"
.."(🎥) #الفيديو "..(redis:get(mae3) or "false").."\n"
.."(↪️)#التوجيه"..(redis:get(mae2) or "false").."\n"
.."(〽️)#الـشارحه "..(redis:get(mae8) or "false").."\n"
.."(🚫) #الروابط"..(redis:get(mae1) or "false").."\n\n"
.."(🌀)#المعرفات "..(redis:get(mae7) or "false").."\n"
.."(❌)#التاك "..(redis:get(mae10) or "false").."\n"
.."(😢)#السمايلات"..(redis:get(mae12) or "false").."\n"
.."(🏌)#الميديا "..(redis:get(mae11) or "false").."\n"
return settings
end
end
return {
    patterns = {
        '^(اعدادات التحذير)$',
        '^(قفل) (الروابط)$',
        '^(فتح) (الروابط)$',
        '^(قفل) (التوجيه)$',
        '^(فتح) (التوجيه)$',
        '^(قفل) (الصور)$',
        '^(فتح) (الصور)$',
        '^(قفل) (الصوت)$',
        '^(فتح) (الصوت)$',
        '^(قفل) (الفيديو)$',
        '^(فتح) (الفيديو)$',
        '^(قفل) (الدردشه)$',
        '^(فتح) (الدردشه)$',
        '^(قفل) (المعرف)$',                                --@DevMaestro
        '^(فتح) (المعرف)$',
        '^(قفل) (الشارحه)$',
        '^(فتح) (الشارحه)$',
        '^(قفل) (الانلاين)$',
        '^(فتح) (الانلاين)$',
        '^(قفل) (التاك)$',
        '^(فتح) (التاك)$',
        '^(قفل) (السمايل)$',
        '^(فتح) (السمايل)$',
        '^(قفل) (الميديا)$',
        '^(فتح) (الميديا)$',
    },
    run = DevMaestro,
    pre_process = pre_process
}
